( function ( $ ) {
	'use strict';

	var teVaritype = {
		id: 'te-varitype',
		name: 'వేరిటైప్/ఆపిల్ (లతదవ)',
		description: 'Varitype keyboard layout for Telugu',
		date: '2014-12-28',
		author: 'Veeven',
		license: 'GPLv3',
		version: '1.0',
		patterns: [
			
			// Overrides: when the preceding character is a consonent,
			//   produce joining vowel sign, instead of full vowel character
			['([క-హ]|ౘ|ౙ)w', '$1ీ'],
			['([క-హ]|ౘ|ౙ)W', '$1ృ'],
			['([క-హ]|ౘ|ౙ)e', '$1ా'],
			['([క-హ]|ౘ|ౙ)E', '$1ౄ'],
			['([క-హ]|ౘ|ౙ)r', '$1ీ'],
			['([క-హ]|ౘ|ౙ)t', '$1ొ'],
			['([క-హ]|ౘ|ౙ)y', '$1ో'],
			['([క-హ]|ౘ|ౙ)u', '$1ె'],
			['([క-హ]|ౘ|ౙ)i', '$1ు'],
			['([క-హ]|ౘ|ౙ)o', '$1ే'],
			['([క-హ]|ౘ|ౙ)p', '$1ూ'],
			['([క-హ]|ౘ|ౙ)\\[', '$1ై'],
			['([క-హ]|ౘ|ౙ)\\]', '$1ౌ'],
			
			// numerals row
			['1', '1'],
			['\\!', 'ై'],

			['2', '2'],
			['\\@', '\''],

			['3', '3'],
			['\\#', '%'],

			['4', '4'],
			['\\$', '్పు'],

			['5', '5'],
			['\\%', '్ర'],

			['6', '6'],
			['\\^', '-'],

			['7', '7'],
			['\\&', '|'],

			['8', '8'],
			['\\*', '\''],

			['9', '9'],
			['\\(', '('],

			['0', '0'],
			['\\)', ')'],
			
			['\\-', '-'],
			['_', '_'],
			
			['\\=', '='],
			['\\+', '+'],
			

			// qwerty row
			['q', 'అ'],
			['Q', 'క్ష్మి'],
			
			['w', 'ఈ'],
			['W', 'ఋ'],

			['e', 'ఆ'],
			['E', 'ౠ'],


			['r', 'ఇ'],
			['R', 'ఙ'],

			['t', 'ఒ'],
			['T', 'ఞ'],

			['y', 'ఓ'],
			['Y', 'క్ష'],

			['u', 'ఎ'],
			['U', 'శ్రీ'],

			['i', 'ఉ'],
			['I', '/'],

			['o', 'ఏ'],
			['O', 'స్త్ర'],

			['p', 'ఊ'],
			['P', 'ష్ట్ర'],

			['\\[', 'ఐ'],
			['\\{', 'క్ష్మ'],

			['\\]', 'ఔ'],
			['\\}', '!'],

			['\\', 'ః'],
			['\\|', 'ఁ'],

			// asdf row
			['a', 'ల'],
			['A', 'ళ'],

			['s', 'త'],
			['S', 'థ'],

			['d', 'ద'],
			['D', 'ధ'],

			['f', 'వ'],
			['F', 'శ'],
			
			['g', 'ం'],
			['G', 'ః'],

			['h', '్'],
			['H', '్\u200c'],

			['j', 'క'],
			['J', 'ఖ'],

			['k', 'ర'],
			['K', 'ఱ'],

			['l', 'న'],
			['L', 'ణ'],

			['\\;', 'ప'],
			['\\:', 'ఫ'],

			['\'', 'స'],
			['"', 'ష'],

			// zxcv row
			['z', 'ట'],
			['Z', 'ఠ'],

			['x', 'గ'],
			['X', 'ఘ'],

			['c', 'డ'],
			['C', 'ఢ'],

			['v', 'బ'],
			['V', 'భ'],

			['b', 'మ'],
			['B', 'హ'],

			['n', 'య'],
			['N', 'క్ష్మీ'],

			['m', 'చ'],
			['M', 'ఛ'],

			['\\,', ','],
			['\\<', ':'],

			['\\.', '.'],
			['\\>', '?'],

			['\\/', 'జ'],
			['\\?', 'ఝ'],
			
		],

		patterns_x: [
			['X', 'ॐ'],
			['m', 'ౘ'],
			['4', '₹'],
		],
	};
	$.ime.register( teVaritype );
}( jQuery ) );
